module Problem.P028 where

{-
- Number spiral diagonals
- https://projecteuler.net/problem=28
-}

{-
- [方針1]
- n x n の螺旋とし、両対角線上の数字の合計をS(n)とする。
-
- nが偶数のときは条件に合う螺旋が生成できないのでS(n) = 0である。
-
- nが奇数の場合を考える。
- n = 1の場合は明らかにS(n) = 1である。
- n >= 3の場合、最も外側の対角線上に出現する数字を[a(n),b(n),c(n),d(n)]と表すと、
-   n = 3のとき・・・[a(3),b(3),c(3),d(3)] = [3,5,7,9] = [1+2,1+4,1+6,1+8]
-   n = 5のとき・・・[a(5),b(5),c(5),d(5)] = [13,17,21,25] = [3+10,5+12,7+14,9+16]
-   n = 7のとき・・・[a(7),b(7),c(7),d(7)] = [31,37,43,49] = [13+18,17+20,21+22,25+24]
-   n = 9のとき・・・[a(9),b(9),c(9),d(9)] = [57,65,73,81] = [31+26,37+28,43+30,49+32]
- 一般には
-   [a(1),b(1),c(1),d(1)] = [1,1,1,1]
-   [a(n),b(n),c(n),d(n)] = [a(n-2),b(n-2),c(n-2),d(n-2)] + [4n - 10, 4n - 8, 4n - 6, 4n - 4]
- である。このとき
-   S(n) = S(n-2) + a(n) + b(n) + c(n) + d(n)
- で求められる。
-
- 以上より、
-   [a(1),b(1),c(1),d(1)] = [1,1,1,1]
-   [a(n),b(n),c(n),d(n)] = [a(n-2),b(n-2),c(n-2),d(n-2)] + [4n - 10, 4n - 8, 4n - 6, 4n - 4]
-   S(1)
-   S(n) = S(n-2) + a(n) + b(n) + c(n) + d(n)
- の漸化式を解けばよい。
-
- [結果]
- 669171001
- time:0.009586s
-}

diagonals :: Integral a => a -> [a]
diagonals n | n < 1 = []
            | even n = []
            | n == 1 = [1,1,1,1]
            | otherwise = zipWith (+) (diagonals (n - 2)) [4*n - 10, 4*n - 8, 4*n - 6, 4*n - 4]

solve :: Int -> Integer
solve n | n < 1 = 0
        | n == 1 = 1
        | otherwise = solve (n - 2) + (toInteger $ sum $ diagonals n)
